import React from "react";
import './Policy.scss'

function Policy() {
  return (
    <div className="policy">
      <div className="container">
        <div className="policy-wrapper">
          <span className="policy-wrapper__title">
            Политика конфиденциальности
          </span>
          <span className="policy-wrapper__text">
          Настоящая Политика конфиденциальности определяет и описывает то, как Компания обрабатывает и защищает информацию, которую вы можете предоставить при посещении этого Сайта, и наши методы сбора, использования, обслуживания, защиты и раскрытия этой информации.
Пожалуйста, внимательно прочитайте нашу политику конфиденциальности, чтобы получить четкое представление о том, как мы собираем, используем, защищаем или иным образом обрабатываем вашу личную информацию в связи с использованием вами данного Сайта. Если вы не согласны с нашими политиками и практиками, вы не должны использовать Сайт. Заходя или используя этот Сайт, вы соглашаетесь с настоящей Политикой конфиденциальности. Эта политика может меняться время от времени. Ваше дальнейшее использование этого Сайта после внесения нами изменений считается принятием этих изменений, поэтому, пожалуйста, периодически проверяйте политику на наличие обновлений. Мы укажем дату последнего изменения политики в верхней части Политики конфиденциальности.
1. Информация, которую мы собираем
Мы можем собирать только не личную информацию (не PII). Non-PII - это информация, которая не может идентифицировать отдельное лицо и используется в совокупности для предоставления общей информации о пользователях Сайта.
2. Как мы используем и делимся информацией <br/><br/>
<ul>
    <li>2.1 Мы используем информацию, которую мы собираем, чтобы:</li>
    <li>2.1.1 предоставлять, поддерживать и защищать Услуги;</li>
    <li>2.1.2 уведомлять вас об акциях, новых услугах и специальных предложениях, например, по электронной почте;</li>
    <li>2.1.3 адаптировать наши продукты, обслуживание клиентов и общий опыт;</li>
    <li>2.1.4 улучшать содержание, работу, внешний вид и полезность Услуг;</li>
    <li>2.1.5 проводить опросы, исследования и оценки;</li>
    <li>2.1.6 устранение неполадок и разрешение споров и запросов в службу поддержки клиентов;</li>
    <li>2.1.7 собирать демографические данные;</li>
    <li>2.1.8 выполнять другие административные задачи.</li>
</ul>
<br/>
3. Файлы cookie<br/>
Файлы cookie представляют собой небольшие фрагменты кода, которые обычно хранятся на жестком диске компьютера пользователя, что позволяет веб-сайту «персонализировать» себя для каждого пользователя. Файлы cookie позволяют нам идентифицировать файлы на вашем компьютере и записывать ваши предпочтения и другие данные о вашем посещении нашего веб-сайта, чтобы при возвращении на веб-сайт мы знали, кто вы, и могли персонализировать ваше следующее посещение здесь. Обратите внимание, что файлы cookie могут быть связаны с личной информацией о вас. Использование файлов cookie позволяет нам отслеживать вашу информацию и предотвращает необходимость повторного ввода вашей информации при каждом подключении.
3.1 Мы можем использовать куки для:
3.1.1 Сбора сводных данных о посещаемости сайта и взаимодействиях с сайтом, чтобы в будущем предлагать лучший опыт и инструменты на сайте.
3.1.2 Мы также можем использовать сторонние сервисы, которые отслеживают эту информацию от нашего имени.
Вы можете выбрать, чтобы ваш компьютер предупреждал вас при каждой отправке куки, или вы можете отключить все куки. Вы делаете это через настройки вашего браузера. Каждый браузер имеет свои настройки, поэтому посмотрите в меню «Справка» вашего браузера, чтобы узнать, как правильно изменить файлы cookie. Если вы хотите отключить файлы cookie, некоторые функции могут работать неправильно.
3.2 Профили пользователей: Компания может объединять Non-PII, информацию о файле журнала и информацию о файлах cookie, чтобы создать профиль пользователя или пользователей Сайта, и может использоваться для продвижения на рынок продуктов или услуг для вас, отслеживать деятельность Служб, помогать вести базу данных наших клиентов и управлять электронной почтой, опросами или другими конкурсами.
3.3 Соответствие законодательству / разглашение другой информации: Мы также оставляем за собой право добросовестно раскрывать вашу информацию в соответствии с требованиями законодательства, в ответ на судебный процесс, включая запросы правоохранительных органов, а также с любым физическим или юридическим лицом, которое может приобрести все или часть нашего бизнеса. Или активы, в связи с любым изменением контроля над нами, реорганизацией нашей Компании, роспуском или аналогичным событием. И там, где это необходимо, чтобы предотвратить мошенничество и защитить безопасность, собственность или законные права нашей Компании, наших пользователей, наших аффилированных лиц или любой другой третьей стороны. Мы также можем раскрывать вашу информацию для управления и защиты нашей инфраструктуры информационных технологий и безопасности. Мы также можем раскрывать вашу информацию для любых других целей с вашего согласия. Мы можем передавать вашу информацию сторонним поставщикам услуг или тем, кто выполняет за нас такие функции, как поставщики услуг электронной почты и компании, предоставляющие базы данных. Мы можем поделиться не PII в любое время для любых целей.
3. Do-Not-Track<br/>
«Не отслеживать» - это дополнительная настройка браузера, которая позволяет вам выражать свои предпочтения относительно отслеживания рекламодателями и другими третьими лицами. В настоящее время мы не отвечаем на сигналы Do-Not-Track.
<br/><br/>4. Как получить доступ или изменить вашу информацию
Мы стремимся, чтобы вся личная информация была точной и полной. Вы всегда полностью контролируете информацию, которую мы храним для обслуживания вас. Вы можете изменить свою личную информацию в любое время и так часто, как это необходимо. Вы также можете запросить удаление информации. Информация может быть скрыта или исключена из удаления, если это требуется по закону или является частью расследования мошенничества, или как описано выше в разделе «Использование информации». Вы можете получить доступ к своей личной информации и изменить ее, отправив нам электронное письмо по адресу azidropmail@mail.ru
<br/><br/>5. Хранение и безопасность
Мы будем хранить Non-PII, только в тех случаях, когда этого требует наш бизнес. Затем мы уничтожим или предоставим нечитабельную любую такую ​​информацию при утилизации.
Мы считаем, что безопасность вашей информации является серьезной проблемой, и мы стремимся защитить информацию, которую мы получаем от вас. Мы используем коммерчески обоснованные меры безопасности для защиты от потери, неправильного использования и изменения вашей информации под нашим контролем. Наш веб-сайт регулярно сканируется на наличие дыр в безопасности и известных уязвимостей, чтобы сделать ваш визит на наш сайт максимально безопасным. Мы используем регулярное сканирование вредоносных программ. Мы не используем SSL-сертификат.
Хотя мы принимаем меры предосторожности для защиты ваших данных, никакая передача данных через Интернет не может быть гарантирована на 100%.
Хотя у нас есть соглашения и процедуры проверки для третьих сторон, мы не несем ответственности за действия любых третьих сторон, которые могут получить любую такую ​​информацию.
Вы должны отметить, что безопасность вашей личной информации также зависит от вас. Пожалуйста, не сообщайте нам какую-либо информацию по незащищенным каналам, например, когда вы находитесь в общественных местах. Если мы предоставили вам или вы выбрали пароль, код доступа или аналогичную функцию безопасности, вы должны хранить пароль, код доступа или функцию безопасности в секрете. Пожалуйста, не передавайте свой пароль никому. Если вы считаете, что ваш пароль или учетная запись были взломаны, свяжитесь с нами по адресу azidropmail@mail.ru
<br/><br/>6. COPPA (Закон о защите конфиденциальности детей в Интернете)
Наш сайт не предназначен для детей младше 13 лет. Мы сознательно не собираем личную информацию от детей младше 13 лет. Если вам не исполнилось 13 лет, не используйте и не предоставляйте какую-либо информацию на этом Сайте и не предоставляйте нам какую-либо информацию о себе, включая ваше имя, адрес, номер телефона, адрес электронной почты. Или любое отображаемое имя или имя пользователя, которое вы можете использовать. Если мы узнаем, что мы собрали или получили личную информацию от ребенка младше 13 лет без подтверждения согласия родителей, мы удалим эту информацию. Если вы считаете, что мы можем получить какую-либо информацию о ребенке младше 13 лет или о нем, свяжитесь с нами по адресу azidropmail@mail.ru
<br/><br/>7. CAN SPAM ACT
Мы собираем адреса электронной почты, представленные на Сайте. Если вы не хотите, чтобы ваш адрес электронной почты или номер телефона использовались Компанией для продвижения наших собственных услуг или продуктов или услуг третьих сторон, вы можете отказаться, отправив нам электронное письмо с указанием вашего запроса на отказ от azidrop. Обратите внимание, что после того, как ваша информация уже была передана или продана третьим лицам, мы не можем отказаться от получения каких-либо маркетинговых или рекламных электронных писем, отправленных этими третьими сторонами. Вам нужно будет связаться с третьими лицами напрямую, чтобы отписаться от получения электронных писем от них.
<br/><br/>8. Изменения в Политике конфиденциальности
Мы можем изменить эту Политику конфиденциальности в любое время. Когда мы это сделаем, мы обновим дату в верхней части этой страницы. Пересмотренная Политика конфиденциальности вступает в силу немедленно после публикации на Сайте. Мы рекомендуем пользователям регулярно проверять эту страницу на наличие изменений, чтобы всегда быть в курсе того, как мы помогаем защитить личную информацию, которую мы собираем.
Вы признаете и соглашаетесь с тем, что вы обязаны периодически просматривать настоящую Политику конфиденциальности, чтобы узнать о любых изменениях в настоящей Политике конфиденциальности. Ваше дальнейшее использование Сайта после вступления в силу таких изменений будет означать ваше признание и принятие условий пересмотренной Политики конфиденциальности.
<br/><br/>9. Связаться с нами
Если есть какие-либо вопросы относительно этой политики конфиденциальности, вы можете связаться с нами по Email:
Тех. Поддержка: azidropmail@mail.ru
Настоящее Соглашение было составлено на русском языке. В случае наличия каких-либо несоответствий между версией Соглашения, составленной на русском языке, и версией Соглашения, переведенной на другой язык, приоритет и прямое применение будут иметь положения Соглашения, составленные на русском языке.

          </span>
        </div>
      </div>
    </div>
  );
}

export default Policy;
